package mc.sn.day5;

public class 용어 {

}

/*
 * 클래스: 자바에서 사용하는 기본 단위, 모든 작업지시는 클래스 안에 있어야된다
 * 메소드: 클래스에 작업지시를 모아둔게 메소드. 어떤 특정한 작업을 진행한다.
 * 파라메터: 가인수 타입을 결정하는것, 내가 어떠한 데이터를 받아드리겠다
 * 매개변수: 메소드가 실행할 때 필요한 데이터를 외부로부터 받기 위해 사용되는것
 * 실인수: 진짜 값, 실제값 argument
 * 가인수: 실제값이 아니라 타입을 결정하는것
 * 인자: 인수하고 똑같음.
 * 알고리즘: 노력이작게끔 실행시키는게 알고리즘
 * 타입: value
 * 
 * 식별자: 변수 이름
 * 생성자: 생성시에 동작하는 코드
 * 참조형: reference data type 한개 이상의 데이터 저장
 * 기본형: primitive data type 한가지 데이터 저장
 * 키워드: 문장을 만들어낼때 문자체계(알파벳, 한글, 자바에서는 키워드와 기호) 키워드와 기호는 컴파일러가 해석한다.
 * 연산: 프로그램에서 데이터를 처리하여 결과를 산출하는것
 * 연산자: 연산에 사용 되는 표시나 기호
 * 
 * 초기화: 변수의 최초로 값을 할당하는 과정. 배열 초기화 할때는 new 라고 썻었음.
 * 인덱스: 여러개의 데이터를 가지고 있는 배열내의 데이터에서
 * 요소: 인덱스 내에 있는 데이터
 * 배열: 같은 타입의 변수들을 묶어 놓은 집합, 여러가지 값을 저장할수 있는 데이터 타입 요렇게 변함 -> int[]
 * 
 * 인스턴스: 프로그램 실행할때의 기본 단위
 */

