package mc.sn.day4;

public class 객체지향프로그래밍노트 {

}
/*
 * 부품 객체를 먼저 만들고 이것들을 만들고 이것들을 하나씩 조립해 완성된 프로그램을 만드는 기법
 * 객체지향에서의 기본3R: responsibility, reuse, relation (강사님 어피셜) 결론:재사용하는것이 목적이다.
 * 인스턴스(instance)란 entity (예: 개별적으로 운전하는 기사)
 * 클라스와 인스턴스를 구분하는 것이 목표
 * 클라스가 자기책임성을 완수하려면 인스턴스화 되어야 한다. 
 * 즉, 예를들어 자동차를 산다고 했을때, 클라스는 자동차를 생각한 개념이고, 구매를 확정짓고 실체화하는것이 인스턴스화(instantiation) 한것이다.
 * review r = new review() <----괄호를 부여하여 인스턴스화 하는것이다.
 * 클래스는 두개로 나뉜다 - 실행클래스(main class 인스턴스가 실행할수있는 공간), 서비스클래스(인스턴스화 하는곳)
 */





 

